/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstadd_front.c                                  :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: zu <zu@student.42.fr>                      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/05/12 17:18:27 by hmeriann          #+#    #+#             */
/*   Updated: 2022/03/05 16:21:26 by zu               ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"
/*добавляет элемент в начало списка: говорим, что new встает перед *lst,
а указатель на *lst теперь указываетс на new */

void	ft_lstadd_front(t_llist **lst, t_llist *new)
{
	new -> next = *lst;
	new->prev = NULL;
	*lst = new;
}
